In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("Timezone_Handling.csv")

In [3]:
df["Date Time"]= pd.to_datetime(df['Date Time'])

In [4]:
df.set_index("Date Time",inplace=True)

In [5]:
df

                     Price
Date Time
2017-08-17 09:00:00  72.38
2017-08-17 09:15:00  71.00
2017-08-17 09:30:00  71.67
2017-08-17 10:00:00  72.80
2017-08-17 10:30:00  73.00
2017-08-17 11:00:00  72.50

In [6]:
df.shift(1)

                     Price
Date Time
2017-08-17 09:00:00    NaN
2017-08-17 09:15:00  72.38
2017-08-17 09:30:00  71.00
2017-08-17 10:00:00  71.67
2017-08-17 10:30:00  72.80
2017-08-17 11:00:00  73.00

In [7]:
df.shift(2)

                     Price
Date Time
2017-08-17 09:00:00    NaN
2017-08-17 09:15:00    NaN
2017-08-17 09:30:00  72.38
2017-08-17 10:00:00  71.00
2017-08-17 10:30:00  71.67
2017-08-17 11:00:00  72.80

In [8]:
df.shift(-1)

                     Price
Date Time
2017-08-17 09:00:00  71.00
2017-08-17 09:15:00  71.67
2017-08-17 09:30:00  72.80
2017-08-17 10:00:00  73.00
2017-08-17 10:30:00  72.50
2017-08-17 11:00:00    NaN

In [9]:
df["Prev day price"]=df["Price"].shift(1)

In [10]:
df

                     Price  Prev day price
Date Time
2017-08-17 09:00:00  72.38             NaN
2017-08-17 09:15:00  71.00           72.38
2017-08-17 09:30:00  71.67           71.00
2017-08-17 10:00:00  72.80           71.67
2017-08-17 10:30:00  73.00           72.80
2017-08-17 11:00:00  72.50           73.00

In [11]:
df["1 day change"]=df["Price"]-df["Prev day price"]

In [12]:
df

                     Price  Prev day price  1 day change
Date Time
2017-08-17 09:00:00  72.38             NaN           NaN
2017-08-17 09:15:00  71.00           72.38         -1.38
2017-08-17 09:30:00  71.67           71.00          0.67
2017-08-17 10:00:00  72.80           71.67          1.13
2017-08-17 10:30:00  73.00           72.80          0.20
2017-08-17 11:00:00  72.50           73.00         -0.50

In [13]:
df['5 day return'] =  (df['Price'] - df['Price'].shift(5))*100/df['Price'].shift(5)
df

                     Price  Prev day price  1 day change  5 day return
Date Time
2017-08-17 09:00:00  72.38             NaN           NaN           NaN
2017-08-17 09:15:00  71.00           72.38         -1.38           NaN
2017-08-17 09:30:00  71.67           71.00          0.67           NaN
2017-08-17 10:00:00  72.80           71.67          1.13           NaN
2017-08-17 10:30:00  73.00           72.80          0.20           NaN
2017-08-17 11:00:00  72.50           73.00         -0.50      0.165792

In [16]:
df=df[["Price"]]

In [17]:
df

                     Price
Date Time
2017-08-17 09:00:00  72.38
2017-08-17 09:15:00  71.00
2017-08-17 09:30:00  71.67
2017-08-17 10:00:00  72.80
2017-08-17 10:30:00  73.00
2017-08-17 11:00:00  72.50

In [18]:
df.index

DatetimeIndex(['2017-08-17 09:00:00', '2017-08-17 09:15:00',
               '2017-08-17 09:30:00', '2017-08-17 10:00:00',
               '2017-08-17 10:30:00', '2017-08-17 11:00:00'],
              dtype='datetime64[ns]', name='Date Time', freq=None)

In [22]:
df.index=pd.date_range(start="2017-08-17",periods=6,freq="B")

In [23]:
df.index

DatetimeIndex(['2017-08-17', '2017-08-18', '2017-08-21', '2017-08-22',
               '2017-08-23', '2017-08-24'],
              dtype='datetime64[ns]', freq='B')

In [24]:
df

            Price
2017-08-17  72.38
2017-08-18  71.00
2017-08-21  71.67
2017-08-22  72.80
2017-08-23  73.00
2017-08-24  72.50

In [25]:
df.tshift(1)

<ipython-input-25-ddee8c46d442>:1: FutureWarning: tshift is deprecated and will be removed in a future version. Please use shift instead.
  df.tshift(1)

            Price
2017-08-18  72.38
2017-08-21  71.00
2017-08-22  71.67
2017-08-23  72.80
2017-08-24  73.00
2017-08-25  72.50